feaser/openblt/Target/Source/ARMCM0_STM32C0/flash.c
  /* search through the sectors to find the right one */
  for (sectorIdx = 0; sectorIdx < FLASH_TOTAL_SECTORS; sectorIdx++)
  {
    /* keep the watchdog happy */
    CopService();
    if (flashLayout[sectorIdx].sector_num == sector)
    {
      return flashLayout[sectorIdx].sector_start;
    }
  }
  /* still here so no valid sector found */
  return FLASH_INVALID_ADDRESS;
} /*** end of FlashGetSectorBaseAddr ***/


/************************************************************************************//**
** \brief     Determines the flash sector size.
** \param     sector Sector to get the size of.
** \return    Flash sector size or 0.
**
****************************************************************************************/
static blt_addr FlashGetSectorSize(blt_int8u sector)
{
  blt_int8u sectorIdx;

  /* search through the sectors to find the right one */
  for (sectorIdx = 0; sectorIdx < FLASH_TOTAL_SECTORS; sectorIdx++)
  {
    /* keep the watchdog happy */
    CopService();
    if (flashLayout[sectorIdx].sector_num == sector)
    {
      return flashLayout[sectorIdx].sector_size;
    }
  }
  /* still here so no valid sector found */
  return 0;
} /*** end of FlashGetSectorSize ***/


/************************************************************************************//**
** \brief     Determines the flash page that the address belongs to.
** \param     address Flash memory address.
** \return    Page number.
**
****************************************************************************************/
static blt_int32u FlashGetPage(blt_addr address)
{
  blt_int32u result;

  /* assert that the address is actually a valid flash address */
  ASSERT_RT(address >= FLASH_BASE);
  ASSERT_RT((address - FLASH_BASE) < FLASH_SIZE);

  /* calculate the flash page. */
  result = (address - FLASH_BASE) / FLASH_ERASE_BLOCK_SIZE;

  /* give the result back to the caller */
  return result;
} /*** end of FlashGetPage ***/


/*********************************** end of flash.c ************************************/
